{
  "fish_species": [
    {
      "name": "Rainbow Trout",
      "description": "Rainbow trout are freshwater fish characterized by a colorful stripe running along their bodies. They are popular game fish known for their fighting ability.",
      "image_link": "fishImages/rainbow_trout.jpg",
      "fishing_method": "Rainbow trout can be caught using various methods including fly fishing, spinning, and bait fishing. They are often found in streams, rivers, and lakes.",
      "habitat": "North American Freshwater",
      "link": "fish_temp.html?fishId=rainbow_trout",
      "size": "Medium", 
      "popularity": "90",
      "fishId": "rainbow_trout"
    },
    {
      "name": "Muskellunge",
      "description": "Muskellunge, commonly known as musky, are large freshwater fish native to North America. They are apex predators known for their aggressive strikes and powerful fights.",
      "image_link": "fishImages/musky.jpg",
      "fishing_method": "Muskies are often targeted by anglers using large lures such as jerkbaits, bucktails, and crankbaits. They are primarily found in lakes, reservoirs, and large rivers.",
      "habitat": "North American Freshwater",
      "link": "fish_temp.html?fishId=musky",
      "size": "Extra Large",
      "popularity": "85",
      "fishId": "musky"
    },
    {
      "name": "Channel Catfish",
      "description": "Channel catfish are freshwater fish with a distinctive forked tail and barbels around their mouth. They are popular among anglers for their willingness to bite and excellent taste.",
      "image_link": "fishImages/channel_catfish.jpg",
      "fishing_method": "Channel catfish can be caught using a variety of baits such as worms, chicken livers, and stink baits. They are commonly found in rivers, lakes, and ponds.",
      "habitat": "North American Freshwater",
      "link": "fish_temp.html?fishId=channel_catfish",
      "size": "Medium",
      "popularity": "75",
      "fishId": "channel_catfish"
    },
    {
      "name": "Bluegill",
      "description": "Bluegill, also known as bream, are freshwater fish with striking blue and green coloration on their gill covers. They are popular panfish among anglers.",
      "image_link": "fishImages/bluegill.jpg",
      "fishing_method": "Bluegill are often caught using small hooks and bait such as worms or insects. They are commonly found in lakes, ponds, and slow-moving rivers.",
      "habitat": "North American Freshwater",
      "link": "fish_temp.html?fishId=bluegill",
      "size": "Small",
      "popularity": "70",
      "fishId": "bluegill"
    },
    {
      "name": "Largemouth Bass",
      "description": "Largemouth bass are predatory freshwater fish known for their large mouths and aggressive feeding behavior. They are prized by anglers for their fighting ability.",
      "image_link": "fishImages/largemouth_bass.jpg",
      "fishing_method": "Largemouth bass are often caught using artificial lures such as crankbaits, spinnerbaits, and plastic worms. They are commonly found in lakes, ponds, and rivers with abundant cover.",
      "habitat": "North American Freshwater",
      "popularity": "85",
      "size": "Medium",
      "link": "fish_temp.html?fishId=largemouth_bass",
      "fishId": "largemouth_bass"
    },
    {
      "name": "Yellow Perch",
      "description": "Yellow perch are freshwater fish with distinctive yellow coloration and vertical stripes. They are popular among anglers for their delicious taste.",
      "image_link": "fishImages/yellow_perch.jpg",
      "fishing_method": "Yellow perch are often caught using small jigs or live bait such as minnows or worms. They are commonly found in lakes, ponds, and slow-moving rivers.",
      "habitat": "North American Freshwater",
      "popularity": "75",
      "size": "Small",
      "link": "fish_temp.html?fishId=yellow_perch",
      "fishId": "yellow_perch"
    },
    {
      "name": "Tuna",
      "description": "Tuna are large and fast saltwater fish known for their streamlined bodies and powerful swimming abilities. They are highly sought after for sport fishing and commercial harvesting.",
      "image_link": "fishImages/tuna.jpg",
      "fishing_method": "Tuna are often caught using trolling, chunking, or casting techniques in open waters. They are found in both coastal and offshore habitats.",
      "habitat": "Saltwater",
      "popularity": "90",
      "size": "Extra Large",
      "link": "fish_temp.html?fishId=tuna",
      "fishId": "tuna"
    },
    {
      "name": "Clownfish",
      "description": "Clownfish are small tropical marine fish known for their vibrant orange and white coloration. They are often associated with coral reefs and sea anemones.",
      "image_link": "fishImages/clownfish.jpg",
      "fishing_method": "Clownfish are not typically targeted by anglers due to their popularity in aquarium trade. They are commonly found in coral reef habitats.",
      "habitat": "Tropical",
      "popularity": "80",
      "size": "Small",
      "link": "fish_temp.html?fishId=clownfish",
      "fishId": "clownfish"
    },
    {
      "name": "Angelfish",
      "description": "Angelfish are brightly colored tropical fish known for their distinctive shape and graceful movements. They are popular aquarium fish.",
      "image_link": "fishImages/angelfish.jpg",
      "fishing_method": "Angelfish are not typically targeted by anglers due to their popularity in aquarium trade. They are commonly found in coral reef habitats.",
      "habitat": "Tropical",
      "popularity": "75",
      "size": "Small",
      "link": "fish_temp.html?fishId=angelfish",
      "fishId": "angelfish"
    },
    {
      "name": "Anglerfish",
      "description": "Deep sea anglerfish are bizarre-looking fish with a bioluminescent lure dangling from their heads. They inhabit the deep ocean and are rarely encountered by humans.",
      "image_link": "fishImages/anglerfish.jpg",
      "fishing_method": "Deep sea anglerfish are not targeted by recreational anglers due to their deep-sea habitat and specialized adaptations.",
      "habitat": "Deep Sea",
      "popularity": "65",
      "size": "Medium",
      "link": "fish_temp.html?fishId=anglerfish",
      "fishId": "anglerfish"
    },
    {
      "name": "Giant Squid",
      "description": "Giant squid are enormous cephalopods that inhabit the deep ocean. They are elusive creatures known for their enormous size and mysterious behavior.",
      "image_link": "fishImages/giant_squid.jpg",
      "fishing_method": "Giant squid are not typically caught by anglers due to their deep-sea habitat and rarity.",
      "habitat": "Deep Sea",
      "popularity": "60",
      "size": "Large",
      "link": "fish_temp.html?fishId=giant_squid",
      "fishId": "giant_squid"
    },
    {
      "name": "Blobfish",
      "description": "Blobfish are deep-sea fish with gelatinous bodies and a distinctive droopy appearance. They inhabit the deep ocean at depths of up to 4,000 feet.",
      "image_link": "fishImages/blobfish.jpg",
      "fishing_method": "Blobfish are not targeted by recreational anglers due to their deep-sea habitat and specialized adaptations.",
      "habitat": "Deep Sea",
      "popularity": "40",
      "size": "Medium",
      "link": "fish_temp.html?fishId=blobfish",
      "fishId": "blobfish"
    },
    {
      "name": "Piranha",
      "description": "Piranhas are predatory freshwater fish known for their sharp teeth and fearsome reputation. They inhabit the rivers of the Amazon Basin.",
      "image_link": "fishImages/piranha.jpg",
      "fishing_method": "Piranhas are not typically targeted by anglers due to their aggressive behavior. They are commonly found in the Amazon River and its tributaries.",
      "habitat": "Amazon",
      "popularity": "70",
      "size": "Small",
      "link": "fish_temp.html?fishId=piranha",
      "fishId": "piranha"
    },
    {
      "name": "Arapaima",
      "description": "Arapaima are large freshwater fish native to the Amazon Basin. They are among the largest freshwater fish in the world and are prized by anglers for their size and strength.",
      "image_link": "fishImages/arapaima.jpg",
      "fishing_method": "Arapaima are often targeted by anglers using large lures or live bait. They are primarily found in the Amazon River and its floodplain lakes.",
      "habitat": "Amazon",
      "popularity": "80",
      "size": "Extra Large",
      "link": "fish_temp.html?fishId=arapaima",
      "fishId": "arapaima"
    },
    {
      "name": "Electric Eel",
      "description": "Electric eels are unique freshwater fish capable of generating electric shocks. They inhabit the rivers and streams of the Amazon Basin.",
      "image_link": "fishImages/electric_eel.jpg",
      "fishing_method": "Electric eels are not targeted by anglers due to their dangerous electric discharges. They are commonly found in the Amazon River and its tributaries.",
      "habitat": "Amazon",
      "popularity": "60",
      "size": "Large",
      "link": "fish_temp.html?fishId=electric_eel",
      "fishId": "electric_eel"
    },
    {
      "name": "Anemonefish",
      "description": "Anemonefish, also known as clownfish, are small, brightly colored fish found in the warmer waters of the Indian and Pacific Oceans. They form symbiotic relationships with sea anemones and are famous for their unique behavior and appearance.",
      "image_link": "fishImages/anemonefish.jpg",
      "fishing_method": "Anemonefish are not typically targeted by anglers for fishing.",
      "habitat": "Indian and Pacific Oceans",
      "link": "fish_temp.html?fishId=anemonefish",
      "size": "Small",
      "popularity": "75",
      "fishId": "anemonefish"
    },
    {
      "name": "Redtail Catfish",
      "description": "Redtail catfish are large freshwater fish native to the Amazon Basin. They are known for their distinctive red tails and voracious appetite.",
      "image_link": "fishImages/redtail_catfish.jpg",
      "fishing_method": "Redtail catfish are often targeted by anglers using large baits such as fish or meat. They are primarily found in the Amazon River and its tributaries.",
      "habitat": "Amazon",
      "popularity": "70",
      "size": "Large",
      "link": "fish_temp.html?fishId=redtail_catfish",
      "fishId": "redtail_catfish"
    },
    {
      "name": "Oscar Fish",
      "description": "Oscar fish are colorful freshwater cichlids native to the Amazon Basin. They are popular aquarium fish known for their intelligence and personality.",
      "image_link": "fishImages/oscar_fish.jpg",
      "fishing_method": "Oscar fish are not typically targeted by anglers. They are commonly found in slow-moving rivers and flooded areas of the Amazon Basin.",
      "habitat": "Amazon",
      "popularity": "50",
      "size": "Medium",
      "link": "fish_temp.html?fishId=oscar_fish",
      "fishId": "oscar_fish"
    },
    {
      "name": "Yellowtail Snapper",
      "description": "Yellowtail snapper are reef-associated saltwater fish found in tropical and subtropical waters. They are prized by anglers for their delicious taste and fighting ability.",
      "image_link": "fishImages/yellowtail_snapper.jpg",
      "fishing_method": "Yellowtail snapper are often caught using bait or lures around coral reefs and rocky outcrops. They are commonly found in the Caribbean Sea and the Gulf of Mexico.",
      "habitat": "Saltwater",
      "popularity": "75",
      "size": "Medium",
      "link": "fish_temp.html?fishId=yellowtail_snapper",
      "fishId": "yellowtail_snapper"
    },
    {
      "name": "Dolphinfish (Mahi-Mahi)",
      "description": "Dolphinfish, also known as mahi-mahi or dorado, are colorful saltwater fish with distinctive green and yellow hues. They are highly sought after by anglers for their acrobatic fights.",
      "image_link": "fishImages/dolphinfish.jpg",
      "fishing_method": "Dolphinfish are often caught using trolling, casting, or drifting techniques. They are commonly found in warm offshore waters near floating debris or weed lines.",
      "habitat": "Saltwater",
      "popularity": "80",
      "size": "Large",
      "link": "fish_temp.html?fishId=dolphinfish",
      "fishId": "dolphinfish"
    },
    {
      "name": "Striped Bass",
      "description": "Striped bass are popular saltwater fish known for their distinctive stripes and strong fighting ability. They are highly prized by anglers for both recreational and commercial purposes.",
      "image_link": "fishImages/striped_bass.jpg",
      "fishing_method": "Striped bass are often caught using bait such as live or cut baitfish, as well as lures such as plugs or jigs. They are commonly found in coastal waters, estuaries, and rivers.",
      "habitat": "Saltwater",
      "popularity": "80",
      "size": "Large",
      "link": "fish_temp.html?fishId=striped_bass",
      "fishId": "striped_bass"
    },
    {
      "name": "Red Snapper",
      "description": "Red snapper are reef-dwelling saltwater fish known for their vibrant red coloration and delicious flavor. They are highly prized by anglers for both their sport and table qualities.",
      "image_link": "fishImages/red_snapper.jpg",
      "fishing_method": "Red snapper are often caught using bait such as squid or cut fish, as well as artificial lures. They are commonly found around reefs, wrecks, and offshore structures.",
      "habitat": "Saltwater",
      "popularity": "75",
      "size": "Medium",
      "link": "fish_temp.html?fishId=red_snapper",
      "fishId": "red_snapper"
    },
    {
      "name": "Parrotfish",
      "description": "Parrotfish are colorful tropical fish known for their distinctive beak-like mouths and vibrant scales. They play a crucial role in reef ecosystems by grazing on algae and helping to maintain coral health.",
      "image_link": "fishImages/parrotfish.jpg",
      "fishing_method": "Parrotfish are not typically targeted by anglers for sport fishing due to their importance in reef ecosystems. They are commonly found in coral reef habitats.",
      "habitat": "Tropical",
      "popularity": "70",
      "size": "Medium",
      "link": "fish_temp.html?fishId=parrotfish",
      "fishId": "parrotfish"
    },
    {
      "name": "Moorish Idol",
      "description": "Moorish idols are strikingly patterned tropical fish with long, trailing dorsal fins. They are often found in small groups and are popular additions to marine aquariums.",
      "image_link": "fishImages/moorish_idol.jpg",
      "fishing_method": "Moorish idols are not targeted by anglers for sport fishing. They are commonly found in coral reef habitats.",
      "habitat": "Tropical",
      "popularity": "65",
      "size": "Small",
      "link": "fish_temp.html?fishId=moorish_idol",
      "fishId": "moorish_idol"
    },
    {
      "name": "Blue Tang",
      "description": "Blue tangs are bright blue tropical fish with a distinctive oval shape and yellow tail fin. They are popular aquarium fish and are often found in coral reef ecosystems.",
      "image_link": "fishImages/blue_tang.jpg",
      "fishing_method": "Blue tangs are not typically targeted by anglers for sport fishing. They are commonly found in coral reef habitats.",
      "habitat": "Tropical",
      "popularity": "60",
      "size": "Small",
      "link": "fish_temp.html?fishId=blue_tang",
      "fishId": "blue_tang"
    },
    {
      "name": "Lionfish",
      "description": "Lionfish are venomous tropical fish known for their striking appearance and long, flowing fins. They are invasive species in many parts of the world and pose a threat to native marine life.",
      "image_link": "fishImages/lionfish.jpg",
      "fishing_method": "Lionfish are often targeted by divers for removal efforts to control their populations. They are commonly found in coral reef habitats.",
      "habitat": "Tropical",
      "popularity": "55",
      "size": "Medium",
      "link": "fish_temp.html?fishId=lionfish",
      "fishId": "lionfish"
    },
    {
      "name": "Fangtooth Fish",
      "description": "Fangtooth fish are deep-sea fish with large, sharp teeth and elongated bodies. They are among the deepest-dwelling fish species.",
      "image_link": "fishImages/fangtooth_fish.jpg",
      "fishing_method": "Fangtooth fish are not targeted by recreational anglers due to their deep-sea habitat and specialized adaptations.",
      "habitat": "Deep Sea",
      "size": "Small",
      "popularity": "35",
      "link": "fish_temp.html?fishId=fangtooth_fish",
      "fishId": "fangtooth_fish"
    },
    {
      "name": "Grenadier",
      "description": "Grenadiers are deep-sea fish with elongated bodies and large eyes. They are found in deep waters worldwide and are often scavengers.",
      "image_link": "fishImages/grenadier.jpg",
      "fishing_method": "Grenadiers are not targeted by recreational anglers due to their deep-sea habitat and specialized adaptations.",
      "habitat": "Deep Sea",
      "size": "Medium",
      "popularity": "30",
      "link": "fish_temp.html?fishId=grenadier",
      "fishId": "grenadier"
    },
    {
      "name": "Barreleye",
      "description": "Barreleye fish are deep-sea fish with transparent heads and tubular eyes. They are found in the mesopelagic zone and are rarely seen by humans.",
      "image_link": "fishImages/barreleye.jpg",
      "fishing_method": "Barreleye fish are not targeted by recreational anglers due to their deep-sea habitat and specialized adaptations.",
      "habitat": "Deep Sea",
      "size": "Small",
      "popularity": "25",
      "link": "fish_temp.html?fishId=barreleye",
      "fishId": "barreleye"
    },
      {
        "name": "Batfish",
        "description": "Batfish are tropical marine fish known for their peculiar appearance resembling a bat. They are bottom-dwelling fish often found in coral reef habitats.",
        "image_link": "fishImages/batfish.jpg",
        "fishing_method": "Batfish are not typically targeted by anglers for fishing purposes.",
        "habitat": "Tropical Marine",
        "popularity": "60",
        "size": "Medium",
        "link": "fish_temp.html?fishId=batfish",
        "fishId": "batfish"
      },
      {
        "name": "Bettas",
        "description": "Bettas, also known as Siamese fighting fish, are freshwater fish known for their vibrant colors and elaborate finnage. They are popular aquarium fish.",
        "image_link": "fishImages/bettas.jpg",
        "fishing_method": "Bettas are not targeted by anglers for fishing purposes.",
        "habitat": "Freshwater",
        "popularity": "70",
        "size": "Small",
        "link": "fish_temp.html?fishId=bettas",
        "fishId": "bettas"
      },
      {
        "name": "Black Scabbardfish",
        "description": "Black scabbardfish are deep-sea fish found in the Atlantic Ocean. They have long, slender bodies and are notable for their dark coloration.",
        "image_link": "fishImages/black_scabbardfish.jpg",
        "fishing_method": "Black scabbardfish are not typically targeted by recreational anglers due to their deep-sea habitat.",
        "habitat": "Deep Sea",
        "popularity": "50",
        "size": "Medium",
        "link": "fish_temp.html?fishId=black_scabbardfish",
        "fishId": "black_scabbardfish"
      },
      {
        "name": "Chinook Salmon",
        "description": "Chinook salmon, also known as king salmon, are anadromous fish native to the North Pacific Ocean and rivers of North America. They are prized by anglers for their large size and excellent fighting ability.",
        "image_link": "fishImages/chinook_salmon.jpg",
        "fishing_method": "Chinook salmon are often caught using techniques such as trolling, drift fishing, and fly fishing in rivers and coastal waters.",
        "habitat": "North American Freshwater",
        "popularity": "85",
        "size": "Large",
        "link": "fish_temp.html?fishId=chinook_salmon",
        "fishId": "chinook_salmon"
      },
      {
        "name": "Deep Sea Anglerfish",
        "description": "Deep-sea anglerfish are bizarre-looking fish with a bioluminescent lure dangling from their heads. They inhabit the deep ocean and are rarely encountered by humans.",
        "image_link": "fishImages/deep_sea_anglerfish.jpg",
        "fishing_method": "Deep-sea anglerfish are not targeted by recreational anglers due to their deep-sea habitat and specialized adaptations.",
        "habitat": "Deep Sea",
        "popularity": "65",
        "size": "Medium",
        "link": "fish_temp.html?fishId=deep_sea_anglerfish",
        "fishId": "deep_sea_anglerfish"
      },
      {
        "name": "Deep Sea Hatchetfish",
        "description": "Deep-sea hatchetfish are small fish with flattened bodies and large, bioluminescent eyes. They inhabit the deep ocean and are adapted to the extreme pressures of the deep sea.",
        "image_link": "fishImages/deep_sea_hatchetfish.jpg",
        "fishing_method": "Deep-sea hatchetfish are not targeted by recreational anglers due to their deep-sea habitat and specialized adaptations.",
        "habitat": "Deep Sea",
        "popularity": "55",
        "size": "Small",
        "link": "fish_temp.html?fishId=deep_sea_hatchetfish",
        "fishId": "deep_sea_hatchetfish"
      },
      {
        "name": "Dragonfish",
        "description": "Dragonfish are deep-sea fish known for their elongated bodies and bioluminescent organs. They inhabit the mesopelagic and bathypelagic zones of the ocean.",
        "image_link": "fishImages/dragonfish.jpg",
        "fishing_method": "Dragonfish are not targeted by recreational anglers due to their deep-sea habitat and specialized adaptations.",
        "habitat": "Deep Sea",
        "popularity": "50",
        "size": "Medium",
        "link": "fish_temp.html?fishId=dragonfish",
        "fishId": "dragonfish"
      },
      {
        "name": "Giant Squid",
        "description": "Giant squid are enormous cephalopods that inhabit the deep ocean. They are elusive creatures known for their enormous size and mysterious behavior.",
        "image_link": "fishImages/giant_squid.jpg",
        "fishing_method": "Giant squid are not typically caught by anglers due to their deep-sea habitat and rarity.",
        "habitat": "Deep Sea",
        "popularity": "60",
        "size": "Large",
        "link": "fish_temp.html?fishId=giant_squid",
        "fishId": "giant_squid"
      },
      {
        "name": "Goldfish",
        "description": "Goldfish are small freshwater fish belonging to the carp family. They are popular aquarium fish known for their bright colors and hardy nature.",
        "image_link": "fishImages/goldfish.jpg",
        "fishing_method": "Goldfish are not targeted by anglers for fishing purposes.",
        "habitat": "Freshwater",
        "popularity": "70",
        "size": "Small",
        "link": "fish_temp.html?fishId=goldfish",
        "fishId": "goldfish"
      },
      {
        "name": "Grenadier",
        "description": "Grenadiers are deep-sea fish with elongated bodies and large eyes. They are found in deep waters worldwide and are often scavengers.",
        "image_link": "fishImages/grenadier.jpg",
        "fishing_method": "Grenadiers are not targeted by recreational anglers due to their deep-sea habitat and specialized adaptations.",
        "habitat": "Deep Sea",
        "size": "Medium",
        "popularity": "30",
        "link": "fish_temp.html?fishId=grenadier",
        "fishId": "grenadier"
      },
      {
        "name": "Guppy",
        "description": "Guppies are small freshwater fish native to South America. They are popular aquarium fish known for their vibrant colors and prolific breeding.",
        "image_link": "fishImages/guppy.jpg",
        "fishing_method": "Guppies are not targeted by anglers for fishing purposes.",
        "habitat": "Freshwater",
        "popularity": "65",
        "size": "Small",
        "link": "fish_temp.html?fishId=guppy",
        "fishId": "guppy"
      },
      {
        "name": "Hatchetfish",
        "description": "Hatchetfish are small fish with thin bodies and flattened heads. They are found in freshwater and brackish habitats in South America.",
        "image_link": "fishImages/hatchetfish.jpg",
        "fishing_method": "Hatchetfish are not typically targeted by recreational anglers due to their small size and habitat preferences.",
        "habitat": "Freshwater",
        "popularity": "45",
        "size": "Small",
        "link": "fish_temp.html?fishId=hatchetfish",
        "fishId": "hatchetfish"
      },
      {
        "name": "Mackerel",
        "description": "Mackerel are fast-swimming pelagic fish found in temperate and tropical seas. They are highly migratory and form large schools.",
        "image_link": "fishImages/mackerel.jpg",
        "fishing_method": "Mackerel are often caught using trolling, jigging, and drift fishing techniques.",
        "habitat": "Saltwater",
        "popularity": "75",
        "size": "Medium",
        "link": "fish_temp.html?fishId=mackerel",
        "fishId": "mackerel"
      },
      {
        "name": "Marlin",
        "description": "Marlin are large, fast-swimming saltwater fish known for their long, spear-like bill and impressive leaps. They are highly prized by sport fishermen.",
        "image_link": "fishImages/marlin.jpg",
        "fishing_method": "Marlin are often caught using trolling techniques with artificial lures or natural bait.",
        "habitat": "Saltwater",
        "popularity": "80",
        "size": "Extra Large",
        "link": "fish_temp.html?fishId=marlin",
        "fishId": "marlin"
      },
      {
        "name": "Permit",
        "description": "Permit are saltwater fish found in shallow tropical waters. They are known for their silver bodies and powerful fights.",
        "image_link": "fishImages/permit.jpg",
        "fishing_method": "Permit are often caught using fly fishing or sight casting techniques in flats and shallow reefs.",
        "habitat": "Saltwater",
        "popularity": "70",
        "size": "Medium",
        "link": "fish_temp.html?fishId=permit",
        "fishId": "permit"
      },
      {
        "name": "Pike",
        "description": "Pike are predatory freshwater fish known for their elongated bodies and sharp teeth. They are apex predators in many northern lakes and rivers.",
        "image_link": "fishImages/pike.jpg",
        "fishing_method": "Pike are often caught using spinning or bait casting techniques with artificial lures or live bait.",
        "habitat": "North American Freshwater",
        "popularity": "70",
        "size": "Large",
        "link": "fish_temp.html?fishId=pike",
        "fishId": "pike"
      },
      {
        "name": "Platies",
        "description": "Platies are small, colorful freshwater fish native to Central America. They are popular aquarium fish known for their peaceful nature and prolific breeding.",
        "image_link": "fishImages/platies.jpg",
        "fishing_method": "Platies are not targeted by anglers for fishing purposes.",
        "habitat": "North American Freshwater",
        "popularity": "60",
        "size": "Small",
        "link": "fish_temp.html?fishId=platies",
        "fishId": "platies"
      },
      {
        "name": "Red Drum",
        "description": "Red drum, also known as redfish or channel bass, are popular saltwater game fish found in the Atlantic Ocean and Gulf of Mexico. They are prized by anglers for their fighting ability and delicious taste.",
        "image_link": "fishImages/red_drum.jpg",
        "fishing_method": "Red drum are often caught using live or cut bait, as well as artificial lures such as spoons or soft plastics.",
        "habitat": "Saltwater",
        "popularity": "75",
        "size": "Large",
        "link": "fish_temp.html?fishId=red_drum",
        "fishId": "red_drum"
      },
      {
        "name": "Tiger Barb",
        "description": "Tiger barbs are small freshwater fish native to Southeast Asia. They are popular aquarium fish known for their striped patterns and active behavior.",
        "image_link": "fishImages/tiger_barb.jpg",
        "fishing_method": "Tiger barbs are not targeted by anglers for fishing purposes.",
        "habitat": "North American Freshwater",
        "popularity": "65",
        "size": "Small",
        "link": "fish_temp.html?fishId=tiger_barb",
        "fishId": "tiger_barb"
      },
      {
        "name": "Trout",
        "description": "Trout are freshwater fish belonging to the Salmonidae family. They are highly valued game fish known for their beauty and sporting qualities.",
        "image_link": "fishImages/trout.jpg",
        "fishing_method": "Trout are often caught using fly fishing, spinning, or bait fishing techniques in rivers, streams, and lakes.",
        "habitat": "North American Freshwater",
        "popularity": "80",
        "size": "Medium",
        "link": "fish_temp.html?fishId=trout",
        "fishId": "trout"
      },
      {
        "name": "Wahoo",
        "description": "Wahoo are fast-swimming saltwater fish found in tropical and subtropical waters worldwide. They are prized by anglers for their speed and excellent table fare.",
        "image_link": "fishImages/wahoo.jpg",
        "fishing_method": "Wahoo are often caught using high-speed trolling techniques with artificial lures or rigged baits.",
        "habitat": "Saltwater",
        "popularity": "70",
        "size": "Large",
        "link": "fish_temp.html?fishId=wahoo",
        "fishId": "wahoo"
      },
      {
        "name": "Perch",
        "description": "Perch are freshwater fish characterized by their distinctive spiny dorsal fins and striped bodies. They are popular among anglers for their abundance in many freshwater habitats.",
        "image_link": "fishImages/perch.jpg",
        "fishing_method": "Perch are often caught using small hooks and bait such as worms or small fish. They are commonly found in lakes, ponds, rivers, and streams.",
        "habitat": "North American Freshwater",
        "link": "fish_temp.html?fishId=perch",
        "size": "Small",
        "popularity": "70",
        "fishId": "perch"
      }
      
    ]
}